app/controllers/posts_controller.rb

INSERT INTO "posts" ("age", "content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])
    p params # use to compare data caught in rack to actual data
    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "39"]]
UPDATE "posts" SET "name" = '', "content" = 'dfasdfsd', "updated_at" = '2013-01-29 18:54:10.969823' WHERE "posts"."id" = 41
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])